8. Consider the following data frame containing a family name, gender of the family member and her/his monthly income in each record.

Name Gender MonthlyIncome (Rs.)
Shah Male 114000.00
Vats Male 65000.00
Vats Female 43150.00
Kumar Female 69500.00
Vats Female 155000.00
Kumar Male 103000.00
Shah Male 55000.00
Shah Female 112400.00
Kumar Female 81030.00
Vats Male 71900.00

Write a program in Python using Pandas to perform the following:
a. Calculate and display familywise gross monthly income.
b. Calculate and display the member with the highest monthly income in a family.
c. Calculate and display monthly income of all members with income greater than Rs. 60000.00.
d. Calculate and display the average monthly income of the female members in the Shah family.

In [1]:
import pandas as pd

In [2]:
df=pd.read_csv('data8.csv')
df

    Name  Gender  MonthlyIncome(Rs.)
0   Shah    Male            114000.0
1   Vats    Male             65000.0
2   Vats  Female             43150.0
3  Kumar  Female             69500.0
4   Vats  Female            155000.0
5  Kumar    Male            103000.0
6   Shah    Male             55000.0
7   Shah  Female            112400.0
8  Kumar  Female             81030.0
9   Vats    Male             71900.0

In [3]:
grp=df.groupby('Name')

###  Calculate and display familywise gross monthly income.

In [4]:
grp.sum('MonthlyIncome(Rs.)')

       MonthlyIncome(Rs.)
Name
Kumar            253530.0
Shah             281400.0
Vats             335050.0

### Calculate and display the member with the highest monthly income in a family.

In [35]:


for name,member in grp:
    print(name)
    print(member[member['MonthlyIncome(Rs.)']==member['MonthlyIncome(Rs.)'].max()])

Kumar
    Name Gender  MonthlyIncome(Rs.)
5  Kumar   Male            103000.0
Shah
   Name Gender  MonthlyIncome(Rs.)
0  Shah   Male            114000.0
Vats
   Name  Gender  MonthlyIncome(Rs.)
4  Vats  Female            155000.0

### Calculate and display monthly income of all members with income greater than Rs. 60000.00.

In [23]:
for name,member in grp:
    print(name)
    print(member[member['MonthlyIncome(Rs.)']>60000])

Kumar
    Name  Gender  MonthlyIncome(Rs.)
3  Kumar  Female             69500.0
5  Kumar    Male            103000.0
8  Kumar  Female             81030.0
Shah
   Name  Gender  MonthlyIncome(Rs.)
0  Shah    Male            114000.0
7  Shah  Female            112400.0
Vats
   Name  Gender  MonthlyIncome(Rs.)
1  Vats    Male             65000.0
4  Vats  Female            155000.0
9  Vats    Male             71900.0

### Calculate and display the average monthly income of the female members in the Shah family.

In [9]:
s=grp.get_group('Shah')
s[s['Gender']=="Female"].mean()

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_9088\1855634258.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  s[s['Gender']=="Female"].mean()

MonthlyIncome(Rs.)    112400.0
dtype: float64